In [1]:
import pandas as pd
from pandas import DataFrame
df = DataFrame(
                [
                    ['Aryan','Singh','Full-time','adminstration',2,20000],
                    ['Rohan','Agarawal','intern','Technical',3,5000],
                    ['Rjya','Shah','Full-time','adminstration',5,10000],
                    ['Yash','Bhatia','Part-time','Technical',7,10000],
                    ['Siddhant','Khanna','Full-time','Management',6,20000],
                ], columns=['First Name','Last name','Type','Department','YoE','Salary']
              )
df

  First Name Last name       Type     Department  YoE  Salary
0      Aryan     Singh  Full-time  adminstration    2   20000
1      Rohan  Agarawal     intern      Technical    3    5000
2       Rjya      Shah  Full-time  adminstration    5   10000
3       Yash    Bhatia  Part-time      Technical    7   10000
4   Siddhant    Khanna  Full-time     Management    6   20000

In [2]:
pd.pivot_table(df,index='Type')

C:\Users\bldea\AppData\Local\Temp\ipykernel_6640\3965019829.py:1: FutureWarning: pivot_table dropped a column because it failed to aggregate. This behavior is deprecated and will raise in a future version of pandas. Select only the columns that can be aggregated.
  pd.pivot_table(df,index='Type')

                 Salary       YoE
Type
Full-time  16666.666667  4.333333
Part-time  10000.000000  7.000000
intern      5000.000000  3.000000

In [3]:
pd.pivot_table(df[['Salary','Type']],index='Type')

                 Salary
Type
Full-time  16666.666667
Part-time  10000.000000
intern      5000.000000

In [4]:
pd.pivot_table(df,index='Type', columns='Department', values='Salary')

Department  Management  Technical  adminstration
Type
Full-time      20000.0        NaN        15000.0
Part-time          NaN    10000.0            NaN
intern             NaN     5000.0            NaN